_posts/language/2016-09-05-english-onion.html
---
layout: post
title: 单词本：蔬菜之洋葱
categories: [language]
tags: [English]
---

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">1</span> onion</h2>
<div class="outline-text-2" id="text-1">
<p>
洋葱应该也算是一种葱吧。小香葱叫 chives，大葱叫 leek，而洋葱却叫 onion，作为中国人，我觉得很恼火，为什么他们要给不同的葱取那么多不同的名字呢？
</p>

<p>
德语 die Zwiebel[`tsvi:bl]<sup>(de)</sup>，法语 l(e)'oignon<sup>(fr)</sup>。其实有时候觉得法语德语的词性还是很讨厌的，法语有阴阳性，而德语居然还有中性。更麻烦的是，德语法语中同样的东西还可能不同性。比如洋葱，德语里是阴性，而法语里却是阳性。
</p>
<ul class="org-ul">
<li>Die Zwiebel hat mehrere Häute. 洋葱有好几层外皮。</li>
<li>La vie est comme un oignon, on retient toujours ses larmes en
l'épluchant.<sup>(fr)</sup> 人生就像一个洋葱，人们泪汪汪的将它层层剥开。</li>
</ul>

<p>
到底还是邻国日韩的文字的感觉更熟悉些。日语洋葱叫玉葱（たまねぎ，tamanegi）<sup>(jp)</sup>，我记得日语鸡蛋叫玉子 (たまご，tamago)<sup>(ja)</sup>，所以，是不是可以推断日本人管白色的东西叫玉呢？而朝鲜语叫 양파（yangpa）<sup>(ko)</sup>，파：葱。看来和我们一样，洋葱是从西洋引进的，所以都叫洋葱。
</p>

<p>
另外，我找到了关于洋葱的 40 个事实：
</p>

<blockquote>
<ol class="org-ol">
<li>Onions are vegetables</li>
<li>Onions are edible</li>
<li>They make you cry…</li>
<li>They make good dip</li>
<li>Onions grow underground</li>
<li>They taste bad raw</li>
<li>They give you bad breath</li>
<li>Onions come in 3 designer colours (red yellow and white)</li>
<li>They can predict the weather in winter</li>
<li>They go good in a BBQ</li>
<li>They are not sweet</li>
<li>Onions have layers</li>
<li>If you chew gum while cooking them you wont cry</li>
<li>They are about 30 calories</li>
<li>They can be sliced, chopped and diced</li>
<li>Onions are shallot‘s cousin</li>
<li>They can be pickled</li>
<li>Onions are like ogres</li>
<li>They can be peeled</li>
<li>They are highly water based</li>
<li>Onion breath can be cured with some parsley</li>
<li>Onion in Japanese is onion</li>
<li>If you leave them out in the sun for too long they start to grow roots</li>
<li>They are eaten heaps in Libya</li>
<li>The heaviest onion was 10 pounds and 14 ounces</li>
<li>Onions don’t grow on the moon</li>
<li>Onion spelled backwards is noinO</li>
<li>They are not like cakes</li>
<li>Onion is pronounced UN-YIN</li>
<li>If onion was a number it would be 151491514</li>
<li>An onion can make a bland sauce</li>
<li>Onions has 3 vowels</li>
<li>Onions have skins</li>
<li>Onions don’t like garlic</li>
<li>there are nice deep fried as rings</li>
<li>Onion rhymes with bunion</li>
<li>Onions make really bad gifts…</li>
<li>Alliumphobia is the fear of smelling onion and garlic</li>
<li>Onions wont stop vampires…</li>
<li>Onions should NEVER be juiced</li>
</ol>
</blockquote>
</div>

<div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> to know one's onions</h3>
<div class="outline-text-3" id="text-1-1">
<p>
形容某人在某一方面很在行：
</p>
<ul class="org-ul">
<li>That car salesman certainly knew his onions, didn't he? 那个汽车销售一定（对汽车销售）很在行，不是吗？</li>
</ul>

<p>
那么问题又来了，为什么“知道自己的洋葱”是很在行的意思呢？根据我的调查，是因为一百多年前，有一个叫 Charles Talbut Onions 的人，他参与了牛津英语词典（Oxford
English Dictionary）编撰，是位单词专家，后来不知道为什么就有 to know one's
onions 的说法，用来形容某人在某一行业很在行的意思。欲知详情，请点击附录链接阅读。
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> traiter qn aux petits oignons</h3>
<div class="outline-text-3" id="text-1-2">
<p>
精心照顾某人。把某人放到小洋葱里（层层呵护）？法国人的浪漫气息体现在在日常生活中啊。
</p>
<ul class="org-ul">
<li>Je les traite aux petits oignons.<sup>(fr)</sup> I give them total care. 我精心照顾他们。</li>
</ul>
</div>
</div>


<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">1.3</span> Occupe-toi de tes oignons</h3>
<div class="outline-text-3" id="text-1-3">
<p>
管好自己的事情。管好自己的洋葱？Mind your own business.
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">2</span> Summary</h2>
<div class="outline-text-2" id="text-2">
<p>
这次学习了洋葱的英法德写法，并且尝试性的扩展到了日韩的单词学习。感觉有点心有余而力不足啊……
</p>

<p>
I feel that, in vacabulary study, I am not the one who knows his onions, but I
will try to learn as many as possible.
</p>
</div>
</div>
